
#-----------------------------------------------------------------------------------------------------------------------

#Конъюнкция(&)(И)
x1 = None
def Conjunction(x, y):
    if x == 1 and y == 1:
        x1 = True
        print(x1)
    else:
        x1 = False
        print(x1)

a1 = int(input('Введите значения 1: '))
b2 = int(input('Введите значения 2: '))
Conjunction(a1, b2)

#-----------------------------------------------------------------------------------------------------------------------

#Дизъюнкция(|)(ИЛИ)
x2 = None
def Disjunction(x, y):
    if x == 0 and y == 0:
        x2 = False
        print(x2)
    else:
        x2 = True
        print(x2)

a3 = int(input('Введите значения 1: '))
b4 = int(input('Введите значения 2: '))
Disjunction(a3, b4)

#-----------------------------------------------------------------------------------------------------------------------

#Искл. дизъюнкция(^)(ИСКЛ. ИЛИ)
x3 = None
def Excl_disjunction(x, y):
    if x == 0 and y == 0:
        x3 = False
        print(x3)
    elif x == 1 and y == 1:
        x3 = False
        print(x3)
    else:
        x3 = True
        print(x3)

a5 = int(input('Введите значения 1: '))
b6 = int(input('Введите значения 2: '))
Excl_disjunction(a5, b6)

#-----------------------------------------------------------------------------------------------------------------------

#Эквиваленция(<->)
x4 = None
def Equivalence(x, y):
    if x == 0 and y == 0:
        x4 = True
        print(x4)
    elif x == 1 and y == 1:
        x4 = True
        print(x4)
    else:
        x4 = False
        print(x4)


a7 = int(input('Введите значения 1: '))
b8 = int(input('Введите значения 2: '))
Excl_disjunction(a7, b8)

#-----------------------------------------------------------------------------------------------------------------------


